---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.FamilyNoExternalParametersError
source: html/3eeea616-44b9-1dee-fec7-d15ae91f2abd.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.FamilyNoExternalParametersError Property

Family's Category can't be changed because the Family contains Shared Parameters which are not permitted in the new Category.

## Syntax (C#)
```csharp
public static FailureDefinitionId FamilyNoExternalParametersError { get; }
```